concepts/thread.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-22 Fri 14:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thread in Operating System</title>
<meta name="author" content="Quan Vu" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://vhquan.github.io/css/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Thread in Operating System</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfedd1d2">1. Why do we need thread?</a></li>
<li><a href="#orgf1a9401">2. Why multi-threading?</a></li>
<li><a href="#org5b3341a">3. Difference between Process and Thread</a></li>
<li><a href="#orgfaba9be">4. Advantages of Thread</a></li>
<li><a href="#orgf5a1ad3">5. Types of Threads</a>
<ul>
<li><a href="#org0860e01">5.1. User level threads</a>
<ul>
<li><a href="#org4ed404e">5.1.1. Advantages of User-level threads</a></li>
<li><a href="#orgbece25d">5.1.2. Disadvantages of User-level threads</a></li>
</ul>
</li>
<li><a href="#org0efd132">5.2. Kernel level threads</a>
<ul>
<li><a href="#org744f67e">5.2.1. Advantages of kernel-level thread</a></li>
<li><a href="#org0ec55f5">5.2.2. Disadvantages of Kernel-level thread</a></li>
</ul>
</li>
<li><a href="#org9252cdf">5.3. Components of Threads</a></li>
</ul>
</li>
<li><a href="#orge927f3e">6. Wikipedia</a>
<ul>
<li><a href="#orgc84dc3c">6.1. Sources:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Within a program, a <b>Thread</b> is a separate execution path. It is a lightweight
process that the operating system can schedule and run concurrently with other
threads. The operating system creates and manages threads, and they share the
same memory and resources as the program that created them. This enables
multiple threads to collaborate and work efficiently within a single program. 
</p>

<p>
A thread is a single sequence stream within a process. Threads are also called
lightweight processes as they posses some of the properties of processes. Each
thread belongs to exactly one process. In an operating system that supports
multithreading, the process can consist of many threads. But threads can be
effective only if CPU is more than 1 otherwise two threads have to context
switch for that single CPU. 
</p>

<div id="outline-container-orgfedd1d2" class="outline-2">
<h2 id="orgfedd1d2"><span class="section-number-2">1.</span> Why do we need thread?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Threads run in parallel improving the application performance. Each such
thread has its own CPU state and stack, but they share the address space of
the process and the environment.</li>
<li>Threads can share common data so they do not need to use interprocess
communication. Like the processes, threads also have states like ready,
executing, blocked, etc.</li>
<li>Priority can be assigned to the threads just like the process, and the
highest priority thread is scheduled first.</li>
<li>Each thread has its own <b>Thread Control Block (TCB)</b>. Like the process, a
context switch occurs for the thread, and register contents are saved in
(TCB). As threads share the same address space and resources,
synchronization is also required for the various activities of the thread.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1a9401" class="outline-2">
<h2 id="orgf1a9401"><span class="section-number-2">2.</span> Why multi-threading?</h2>
<div class="outline-text-2" id="text-2">
<p>
A thread is also known as a lightweight process. The idea is to achive
parallelism by dividing a process into multiple threads. For example, in a
browser, multiple tabs can be different threads. MS Word uses multiple
threads: one thread to format the text, another thread to process input,
etc. More advantages of multithreading are discussed below.
</p>

<p>
Multithreading is a technique used in operating systems to improve the
performance and responsiveness of computer systems. Multithreading allows
multiple threads (i.e., lightweight processes) to share the same resources of
a single process, such as the CPU, memory, and I/O devices.
</p>
</div>
</div>

<div id="outline-container-org5b3341a" class="outline-2">
<h2 id="org5b3341a"><span class="section-number-2">3.</span> Difference between Process and Thread</h2>
<div class="outline-text-2" id="text-3">
<p>
The primary difference is that threads within the same process run in a shared
memory space, while processes run in separate memory spaces. Threads are not
independent of one another like processes are, and as a result, threads share
with other threads their code section, data section, and OS resources (like
open files and signal). But, like a process, a thread has its own program
counter (PC), register set, and stack space.
</p>
</div>
</div>

<div id="outline-container-orgfaba9be" class="outline-2">
<h2 id="orgfaba9be"><span class="section-number-2">4.</span> Advantages of Thread</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Responsiveness: If the process is divided into multiple threads, if one
thread completes its execution, then its output can be immediately returned.</li>
<li>Faster context switch: Context switch time between threads is lower compared
to the process context switch. Process context switching requires more
overhead from the CPU.</li>
<li>Effective utilization of multiprocessor system: If we have multiple threads
in a single process, then we can schedule multiple threads on multiple
processors. This will make process execution faster.</li>
<li>Resource sharing: Resources like code, data, and files can be shared among
all threads within a process. Note: stacks and registers can't be shared
among the threads. Each thread has its own stack and registerss.</li>
<li>Communication: Communication between multiple threads is easier, as the
threads share a common address space, while in the process we have to follow
some specific communication techniques for communication between the two
processes.</li>
<li>Enahcned throughput of the system: If a process is divided into multiple
threads, and each thread function is considered as one job, then the number
of jobs completed per unit of time is increased, thus increasing the
throughput of the system.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5a1ad3" class="outline-2">
<h2 id="orgf5a1ad3"><span class="section-number-2">5.</span> Types of Threads</h2>
<div class="outline-text-2" id="text-5">
<p>
Threads are of two types. 
</p>
<ul class="org-ul">
<li>User level thread.</li>
<li>Kernel level thread.</li>
</ul>
</div>

<div id="outline-container-org0860e01" class="outline-3">
<h3 id="org0860e01"><span class="section-number-3">5.1.</span> User level threads</h3>
<div class="outline-text-3" id="text-5-1">
<p>
User level thread is a type of thread that is not created using system
calls. The kernel has no work in the management of user-level
threads. User-level threads can be easily implemented by the user. In case
when user-level threads are single-handed processes, kernel-level thread
manages them. 
</p>
</div>

<div id="outline-container-org4ed404e" class="outline-4">
<h4 id="org4ed404e"><span class="section-number-4">5.1.1.</span> Advantages of User-level threads</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>Implementation of the User-level thread is easier than kernel level thread.</li>
<li>Context switch time is less in user level thread.</li>
<li>User-level thread is more efficient than kernel-level thread.</li>
<li>Because of the prosence of only Program Counter, Register Set, and Stack
Space, it has a simple representation.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbece25d" class="outline-4">
<h4 id="orgbece25d"><span class="section-number-4">5.1.2.</span> Disadvantages of User-level threads</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>There is a lack of coordination between thread and kernel.</li>
<li>In case of a page fault, the whole process can be blocked.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0efd132" class="outline-3">
<h3 id="org0efd132"><span class="section-number-3">5.2.</span> Kernel level threads</h3>
<div class="outline-text-3" id="text-5-2">
<p>
A kernel level thread is a type of thread that can recognize the Opearting
System easily. Kernel level thread has its own thread table where it keeps
track of the system. The operating system kernel helps in manging
threads. Kernel threads somehow longer context switching time. Kernel helps in
the management of threads.
</p>
</div>

<div id="outline-container-org744f67e" class="outline-4">
<h4 id="org744f67e"><span class="section-number-4">5.2.1.</span> Advantages of kernel-level thread</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>It has up-to-date information on all threads.</li>
<li>Application that block frequency are to be handled by the kernel-level
threads.</li>
<li>Whenever any process requires more time to process, Kernel-level thread
provides more time to it.</li>
</ul>
</div>
</div>

<div id="outline-container-org0ec55f5" class="outline-4">
<h4 id="org0ec55f5"><span class="section-number-4">5.2.2.</span> Disadvantages of Kernel-level thread</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>Kernel-level thread is slower than User-level thread.</li>
<li>Implementation of this type of thread is a little more complex than a
user-level thread.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9252cdf" class="outline-3">
<h3 id="org9252cdf"><span class="section-number-3">5.3.</span> Components of Threads</h3>
<div class="outline-text-3" id="text-5-3">
<p>
These are the basic components of the Operating System.
</p>
<ul class="org-ul">
<li>Stack space</li>
<li>Register set</li>
<li>Program counter</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge927f3e" class="outline-2">
<h2 id="orge927f3e"><span class="section-number-2">6.</span> Wikipedia</h2>
<div class="outline-text-2" id="text-6">
<p>
A <b>thread</b> in computer science is short for a thread of execution. Threads are a
way for a program to <i>split</i> itself into two or more simultaneously (or
pseudo-simultaneously) running tasks. Threads and processes differ from one
operating system to another but, in general, a thread is contained inside a
process and different threads in the same process share the same resources
while different processes in the same multitasking operating system do
not. Threads are lightweight, in terms of the system resources they consume,
as compared with processes.
</p>
</div>

<div id="outline-container-orgc84dc3c" class="outline-3">
<h3 id="orgc84dc3c"><span class="section-number-3">6.1.</span> Sources:</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>David R. Butenhof: <i>Programming with POSIX Threads</i></li>
<li>Bradford Nichols, Dick Buttlar, Jacqueline Proulx Farell: <i>Pthreads
Programming</i></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
